{
  "timestamp": "2025-01-26T15:15:04.698Z",
  "results": [
    {
      "title": "Homepage Load",
      "passed": true,
      "duration": 1445,
      "metrics": {
        "loadTime": 524.3000000000029,
        "ttfb": 82.5,
        "fcp": 508.3999999999942
      }
    },
    {
      "title": "Pricing Page",
      "passed": true,
      "duration": 1085,
      "metrics": {
        "loadTime": 300.79999999998836,
        "ttfb": 154.29999999998836,
        "fcp": 321.6000000000058
      }
    },
    {
      "title": "Blog Page",
      "passed": true,
      "duration": 1470,
      "metrics": {
        "loadTime": 258,
        "ttfb": 88,
        "fcp": 212.3000000000029
      }
    },
    {
      "title": "How It Works Page",
      "passed": false,
      "duration": 956
    }
  ],
  "analysis": {
    "summary": "ISSUES\nCritical:\n- None",
    "issues": [],
    "insights": [
      "The homepage has the longest load time, but it is still within an acceptable range of less than 1 second. This indicates that the page is optimized for fast loading, but there may be room for further optimization.",
      "The pricing page has a longer TTFB than the other pages, indicating that the server response time may be slower for this page. This may be due to heavier server-side processing or other factors that can be optimized for better performance.",
      "The blog page has the fastest FCP, indicating that the initial content rendering is efficient for this page. This may be due to efficient use of above-the-fold content and other optimization techniques that can be applied to other pages as well.",
      "The \"How It Works\" page failed the test, which may be due to missing resources, inefficient code, or other issues that prevent the page from loading completely. It is recommended to investigate this issue further and optimize the page for better performance. This may include optimizing images, minifying code, reducing HTTP requests, and other techniques that can improve page loading times."
    ]
  }
}